{
  "showTmdbId": 103051,
  "showTitle": "Paatal Lok",
  "originalShowTitle": "पाताल लोक",
  "overview": "A down and out cop lands the case of a lifetime when four suspects are nabbed in the assassination attempt of a prime time journalist. The case turns out to be a devious maze where nothing is what it looks like. The pursuit of it leads him to the dark netherworld - the 'Paatal Lok', and to shocking discoveries in the past of the four suspects.",
  "genres": [
    "Crime",
    "Drama"
  ],
  "rating": 7.395,
  "popularity": 8.6272,
  "poster": "/data/posters/show_103051.jpg",
  "backdrop": "/data/backdrops/show_103051_bd.jpg",
  "totalSeasons": 2,
  "totalEpisodes": 17,
  "year": 2020,
  "releaseDate": "2020-05-15",
  "seasons": {
    "1": [
      {
        "fileId": "473",
        "fileName": "Paatal Lok S01E01 Hindi 720p WEB-DL ESub Vegamovies.NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 1,
        "episodeTitle": "Bridges",
        "episodeOverview": "Inspector Hathi Ram Chaudhary is going through his dead beat job when he lands up a big investigation. Three men and a woman have been arrested for the attempt to murder a big prime time journalist Sanjeev Mehra, and Hathi Ram is asked to build a case. Meanwhile, for Mehra, this news couldn’t have come at a worse time for he struggles with problems at work and a boss who wants to fire him.",
        "runtime": 43,
        "tracks": null
      },
      {
        "fileId": "474",
        "fileName": "Paatal Lok S01E02 Hindi 720p WEB-DL ESub Vegamovies.NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 2,
        "episodeTitle": "Lost and Found",
        "episodeOverview": "Hathi Ram and Ansari use every technique in the book to interrogate the four suspects. Finally they manage to break one of them and his statement points to a certain ‘Master ji’ from Chitrakoot. Meanwhile pressure mounts on Sanjeev Mehra at the work front.",
        "runtime": 45,
        "tracks": null
      },
      {
        "fileId": "475",
        "fileName": "Paatal Lok S01E03 Hindi 720p WEB-DL ESub Vegamovies.NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 3,
        "episodeTitle": "A history of violence",
        "episodeOverview": "Hathi Ram reaches Chitrakoot and meets Tyagi's family and school teacher. He comes to know of the beginning of Tyagi's criminal record, and the people Tyagi worked for. Meanwhile Ansari conducts a parallel investigation in Punjab and finds out about Tope Singh's dark past. Sanjeev Mehra pulls off a coup on his television show, surprising friends and foes alike.",
        "runtime": 48,
        "tracks": null
      },
      {
        "fileId": "476",
        "fileName": "Paatal Lok S01E04 Hindi 720p WEB-DL ESub Vegamovies.NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 4,
        "episodeTitle": "Sleepless in Seelampur",
        "episodeOverview": "Hathi Ram gets sucked further into the case, but the investigation hits a dead end with the mysterious death of a key suspect. Sanjeev Mehra starts forming a plan to cash in on his renewed popularity. A procedureal screw up gets blown up and lands Hathi Ram in serious trouble with the bosses.",
        "runtime": 45,
        "tracks": null
      },
      {
        "fileId": "477",
        "fileName": "Paatal Lok S01E05 Hindi 720p WEB-DL ESub Vegamovies.NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 5,
        "episodeTitle": "Of fathers and sons",
        "episodeOverview": "Hathi Ram, suspended from his job, struggles to keep himself away from the case while dealing with rising issues at home. Sanjeev Mehra makes a dubious populist move that does not go well with Sara and creates a rift in their budding romance. CBI starts investigating the case and comes up with a shocking theory.",
        "runtime": 44,
        "tracks": null
      },
      {
        "fileId": "478",
        "fileName": "Paatal Lok S01E06 Hindi 720p WEB-DL ESub Vegamovies.NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 6,
        "episodeTitle": "The past is prologue",
        "episodeOverview": "Hathi Ram travels into the past of Kabir and Cheeni, and that makes him further convinced that the CBI's 'terrorism theory' is fabricated. Hathi Ram's son lands into serious trouble with the bad guys and he is forced to step in and take action.",
        "runtime": 43,
        "tracks": null
      },
      {
        "fileId": "479",
        "fileName": "Paatal Lok S01E07 Hindi 720p WEB-DL ESub Vegamovies.NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 7,
        "episodeTitle": "Badlands",
        "episodeOverview": "Hathi Ram travels to Chitrakoot to pick up the missing threads from where he last left them. Further details emerge on Tyagi's mysterious 'Masterji' and Tyagi's close emotional bond with him. Hathi Ram tails the dangerous Gwala Gujjar, Master ji's brother, and almost gets caught in the act.",
        "runtime": 43,
        "tracks": null
      },
      {
        "fileId": "480",
        "fileName": "Paatal Lok S01E08 Hindi 720p WEB-DL ESub Vegamovies.NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 8,
        "episodeTitle": "Black Widow",
        "episodeOverview": "Following Tyagi's political links, Hathi Ram comes across a mysterious woman who turns out to be the missing link between Tyagi and Tope Singh's story. Hathi Ram pieces together clues that lead him to a startling discovery concerning Master ji.",
        "runtime": 43,
        "tracks": null
      },
      {
        "fileId": "481",
        "fileName": "Paatal Lok S01E09 Hindi 720p WEB-DL ESub Vegamovies.NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 9,
        "episodeTitle": "Swarg ka Dwaar",
        "episodeOverview": "On the run from Gwala's dangerous men, Hathi Ram manages to piece together the entire jigsaw puzzle. Sanjeev's pride at his takeover of the business is bursted by Hathi Ram's shocking revelations. Tyagi discovers the truth about Master ji and that leads him to fulfilling his childhood prophecy. Hathi Ram is grudgingly handed back his badge by the Police Department.",
        "runtime": 44,
        "tracks": null
      }
    ],
    "2": [
      {
        "fileId": "482",
        "fileName": "Paatal_Lok_S02E01_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies_is.mkv",
        "seasonNumber": 2,
        "episodeNumber": 1,
        "episodeTitle": "Head On",
        "episodeOverview": "On a cold winter morning in Lutyens’ Delhi, the room service staff at Nagaland Sadan discover a decapitated head. The victim Jonathan Thom, a Naga leader, was in Delhi for the important Naga Business Summit. IPS officer Ansari leads the murder investigation. Meanwhile, Hathi Ram, investigates a migrant worker's disappearance, only to chance upon a startling discovery.",
        "runtime": 44,
        "tracks": null
      },
      {
        "fileId": "483",
        "fileName": "Paatal_Lok_S02E02_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies_is.mkv",
        "seasonNumber": 2,
        "episodeNumber": 2,
        "episodeTitle": "Kohima Calling",
        "episodeOverview": "DCP Bhardwaj reviews CCTV footage of Raghu Paswan and Rose Lizo. Hathi Ram hopes to join Ansari on the case but is turned down. Hathi Ram investigates a lead that leads to a drug bust but ACP Virk claims the credit. A video of three masked individuals claiming responsibility for Thom's murder stirs media frenzy. In Nagaland, a constable spots Rose Lizo.",
        "runtime": 42,
        "tracks": null
      },
      {
        "fileId": "484",
        "fileName": "Paatal_Lok_S02E03_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies_is.mkv",
        "seasonNumber": 2,
        "episodeNumber": 3,
        "episodeTitle": "Four Murders And A Funeral",
        "episodeOverview": "Hathi Ram and Ansari meet SP Meghna Barua in Nagaland who is sceptical of their presence. Tensions rise at Thom's funeral at the arrival of Thom's estranged son Reuben. Hathi Ram and Ansari learn of Thom’s illicit businesses. A drug dealer, a potential lead in their case, ends up dead. And so do the three individuals who had claimed responsibility for Jonathan Thom’s murder.",
        "runtime": 47,
        "tracks": null
      },
      {
        "fileId": "485",
        "fileName": "Paatal_Lok_S02E04_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies_is.mkv",
        "seasonNumber": 2,
        "episodeNumber": 4,
        "episodeTitle": "Missed Call",
        "episodeOverview": "Hathi Ram and Ansari investigate the murder of the three individuals, only to realise that the three were set up for this. Hathi Ram discovers Raghu Paswan’s link to Reddy’s hotel before travelling to Delhi for his son’s birthday. Meanwhile, Ansari discovers a lead on Rose Lizo and goes looking for her, but so do Reuben and Daniel, Thom’s security officer.",
        "runtime": 44,
        "tracks": null
      },
      {
        "fileId": "486",
        "fileName": "Paatal_Lok_S02E05_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies_is.mkv",
        "seasonNumber": 2,
        "episodeNumber": 5,
        "episodeTitle": "Off Balance",
        "episodeOverview": "The police look for Rose Lizo in the jungles she last disappeared in. Daniel is out there looking for her too. Hathi Ram deals with a personal tragedy in Delhi, and an enquiry into what went wrong back in Kohima. Unable to live with the fact that Ansari is being made the scapegoat, Hathi Ram decides to take matters in his own hands.",
        "runtime": 44,
        "tracks": null
      },
      {
        "fileId": "487",
        "fileName": "Paatal_Lok_S02E06_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies_is.mkv",
        "seasonNumber": 2,
        "episodeNumber": 6,
        "episodeTitle": "Of Mothers And Daughters",
        "episodeOverview": "Hathi Ram and Meghna unite their meagre forces against a raging mob of Thom’s supporters that attacks the hospital Rose Lizo is admitted in. Hathi Ram investigates the murder of a businessman and realises that Reuben has been made the fall guy for the murder. A personal injury leads Hathi Ram to the startling discovery that Rose has a child.",
        "runtime": 45,
        "tracks": null
      },
      {
        "fileId": "488",
        "fileName": "Paatal_Lok_S02E07_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies_is.mkv",
        "seasonNumber": 2,
        "episodeNumber": 7,
        "episodeTitle": "Children Of Men",
        "episodeOverview": "Hathi Ram is abducted and taken to meet Reuben but Meghna manages to be on the tail. Hathi Ram finally comes face to face with Reuben and discovers Reddy’s close links with Thom’s drug business. ACP Virk helps Hathi Ram discover Daniel’s connection to Langchoma which helps Hathi Ram make a startling discovery about Uncle Ken. But before he can reveal it to Meghna, a tragedy strikes.",
        "runtime": 45,
        "tracks": null
      },
      {
        "fileId": "489",
        "fileName": "Paatal_Lok_S02E08_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies_is.mkv",
        "seasonNumber": 2,
        "episodeNumber": 8,
        "episodeTitle": "The Good Samaritan",
        "episodeOverview": "Hathi Ram confronts Daniel on Christmas eve and finally manages to avenge Ansari’s death. The business summit is a success in Delhi and Uncle Ken is hailed, forcing Hathi Ram to reconsider his choices. Hathi Ram returns to Delhi and eventually manages to learn about Raghu Paswan’s innocence and his unnecessary death.",
        "runtime": 46,
        "tracks": null
      }
    ]
  },
  "episodes": [],
  "availableSeasons": [
    1,
    2
  ],
  "availableEpisodeCount": 17
}