{
  "showTmdbId": 107588,
  "showTitle": "Aashram",
  "originalShowTitle": "आश्रम",
  "overview": "A duplicitous, aashram based, Indian Godman's good deeds serve activities criminal and unholy, such as rapes, murders, drugs, vote bank politics and forced male emasculation. The law and a few crusaders investigate to bring him to account.",
  "genres": [
    "Drama",
    "Crime"
  ],
  "rating": 5.176,
  "popularity": 4.3857,
  "poster": "/data/posters/show_107588.jpg",
  "backdrop": "/data/backdrops/show_107588_bd.jpg",
  "totalSeasons": 3,
  "totalEpisodes": 33,
  "year": 2020,
  "releaseDate": "2020-08-28",
  "seasons": {
    "1": [
      {
        "fileId": "528",
        "fileName": "Aashram_S01_E01_2020_WebRip_Hindi_720p_x264_AAC_Vegamovies_NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 1,
        "episodeTitle": "Pran Pratishtha",
        "episodeOverview": "Pammi, the wrestling champion has always faced discrimination and tried her best to raise her voice against the system for the discrimination she has been a victim of, but to no avail. But then, like a ray of hope, Baba Nirala comes to her in the form of a saviour. And then, a body is dug out from a construction site in a forest. Stream the full episode of the latest Hindi web series Ashram online on MX Player!",
        "runtime": 53,
        "tracks": null
      },
      {
        "fileId": "529",
        "fileName": "Aashram_S01_E02_2020_WebRip_Hindi_720p_x264_AAC_Vegamovies_NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 2,
        "episodeTitle": "Grih Pravesh",
        "episodeOverview": "The whole town is in rage when the skeleton is discovered in the forest and Chief Minister Sunderlal’s name comes up in the case. Sub Inspector Ujagar SIngh is assigned to the case and he has to reach the root of the matter. Pammi, on the other hand, is drawn to the magic of Baba Nirala’s devotion! Watch the full MX Originals’ latest web series Ashram in HIndi On MX Player!",
        "runtime": 44,
        "tracks": null
      },
      {
        "fileId": "530",
        "fileName": "Aashram_S01_E03_2020_WebRip_Hindi_720p_x264_AAC_Vegamovies_NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 3,
        "episodeTitle": "Duh Swapna",
        "episodeOverview": "Pammi has decided to give up her career as a wrestler and follow the path of devotion and salvation under the guidance of Baba Nirala. She is highly impressed by the work Baba has done for the poor and the outcastes. Meanwhile the subinector Ujagar SIngh is probing the case of the skeleton. Will he find any lead in the case? All the episodes of the Hindi web show Ashram available on MX Player without signing up. Watch now!",
        "runtime": 43,
        "tracks": null
      },
      {
        "fileId": "531",
        "fileName": "Aashram_S01_E05_2020_WebRip_Hindi_720p_x264_AAC_Vegamovies_NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 5,
        "episodeTitle": "Amrit Sudha",
        "episodeOverview": "Baba Nirala has organized the event of Mass Marriage in the ashram, where Satti would be one of the grooms. The event is attended by Hukum Singh, who offers Baba a luring deal to participate in the upcoming elections. Ujagar Singh makes progress on the case when the skeleton gets identified by a girl and the story unfolds. Will Baba now enter the world of politics and accept Hukum Singh’s deal? Ashram, the latest Hindi show streaming on MX Player now!",
        "runtime": 45,
        "tracks": null
      },
      {
        "fileId": "532",
        "fileName": "Aashram_S01_E06_2020_WebRip_Hindi_720p_x264_AAC_Vegamovies_NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 6,
        "episodeTitle": "Vish Haran",
        "episodeOverview": "Baba comes to know about I.G. Sharma’s investigation on him after the CMs orders and he lays a trap for him, to which he falls prey. Sub Inspector Ujagar Singh in his investigation has led him to a lead inside the ashram named Kavita, but it is impossible to reach her or talk to her. Will Kavita take the risk to contact someone outside the ashram? New Hindi web show Ashram full episodes, star cast, storyline, videos & more available on MX Player for free.",
        "runtime": 44,
        "tracks": null
      },
      {
        "fileId": "533",
        "fileName": "Aashram_S01_E07_2020_WebRip_Hindi_720p_x264_AAC_Vegamovies_NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 7,
        "episodeTitle": "Gati Rodh",
        "episodeOverview": "Ujagar SIngh has dug too deep into the secrets of the ashram and he suspects that he might be near a big breakthrough. But then, he receives a call ordering him to stop the investigation on the case immediately and to not to pursue the case further. Bhopa, on the other hand receives shocking information about someone they had been following. Will Ujagar Singh give up the case? Watch the full MX Originals’ latest web series Ashram in HIndi On MX Player for free!",
        "runtime": 42,
        "tracks": null
      },
      {
        "fileId": "534",
        "fileName": "Aashram_S01_E08_2020_WebRip_Hindi_720p_x264_AAC_Vegamovies_NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 8,
        "episodeTitle": "Shuddhi Karan",
        "episodeOverview": "Baba Nirala wants more support from the younger generation and for this, he calls the famous pop star Tinka Singh to arrange a music show in the ashram which he refuses flatly and also insults Bhopa. Meanwhile, Babita’s looks have created an impression on Baba and he tries to remove Satti from his way. What will Baba do now with Satti and pop star Tinka Singh? All the episodes of the Hindi web show Ashram available on MX Player without signing up. Watch now!",
        "runtime": 45,
        "tracks": null
      },
      {
        "fileId": "535",
        "fileName": "Aashram_S01_E09_2020_WebRip_Hindi_720p_x264_AAC_Vegamovies_NL.mkv",
        "seasonNumber": 1,
        "episodeNumber": 9,
        "episodeTitle": "Maha Prasad",
        "episodeOverview": "All the efforts of Ujagar Singh to continue the investigation have failed. He approaches his friend S. P. Dhandha and the two together decide to pursue the case in secret without letting anyone know. Inside the ashram, Satti has decided to do Shuddhikaran and is being transferred to somewhere else. Babita is shattered on learning this, and then late at night, she is called by Baba to his private quarters. Do not go anywhere, watch the full Hindi web series Ashram for free online on MX Player!",
        "runtime": 47,
        "tracks": null
      }
    ]
  },
  "episodes": [],
  "availableSeasons": [
    1
  ],
  "availableEpisodeCount": 8
}