{
  "showTmdbId": 205715,
  "showTitle": "Gen V",
  "originalShowTitle": "Gen V",
  "overview": "At America's only college for superheroes, gifted students put their moral boundaries to the test, competing for the university's top ranking, and a chance to join The Seven, Vought International's elite superhero team. When the school's dark secrets come to light, they must decide what kind of heroes they want to become.",
  "genres": [
    "Action & Adventure",
    "Drama",
    "Sci-Fi & Fantasy"
  ],
  "rating": 7.693,
  "popularity": 25.5081,
  "poster": "/data/posters/show_205715.jpg",
  "backdrop": "/data/backdrops/show_205715_bd.jpg",
  "totalSeasons": 2,
  "totalEpisodes": 16,
  "year": 2023,
  "releaseDate": "2023-09-28",
  "seasons": {
    "1": [
      {
        "fileId": "284",
        "fileName": "GEN.V.2023.S01E01.720p.10bit.HIN-ENG.x265.ESub.Vegamovies.to.mkv",
        "seasonNumber": 1,
        "episodeNumber": 1,
        "episodeTitle": "God U.",
        "episodeOverview": "Congratulations! You have been chosen for admission to Godolkin University! We're thrilled to be a part of your journey to discovering what kind of super you are! Since its founding in 1965, God U has produced some of the best and brightest superheroes the world has ever known, including three members of The Seven! And who knows? Maybe you'll be next!",
        "runtime": 59,
        "tracks": null
      },
      {
        "fileId": "285",
        "fileName": "GEN.V.2023.S01E02.720p.10bit.HIN-ENG.x265.ESub.Vegamovies.to.mkv",
        "seasonNumber": 1,
        "episodeNumber": 2,
        "episodeTitle": "First Day",
        "episodeOverview": "The Godolkin University Mental Health Hotline would like to remind students at this difficult time that you are not alone. You might be bulletproof on the outside, but you're not on the inside. Our caring staff is trained to deal with the specific emotional needs of superheroes and they're here to help you. If you need to talk to someone, help is just a phone call or vMessage away. #GodUCares",
        "runtime": 49,
        "tracks": null
      },
      {
        "fileId": "286",
        "fileName": "GEN_V_2023_S01E03_720p_WEBRip_HIN_ENG_x264_ESub_Vegamovies_to.mkv",
        "seasonNumber": 1,
        "episodeNumber": 3,
        "episodeTitle": "#ThinkBrink",
        "episodeOverview": "You're invited to the #ThinkBrink Memorial Gala and Fundraiser tonight at Godolkin University! Make sure to dress your best when the doors open at 7PM and you hit the red carpet! Then join the world's hottest superheroes and celebrities for selfies and complimentary champagne, and enjoy a touching tribute video to the legendary Professor Brinkerhoff, featuring A-Train, The Deep, and Polarity!",
        "runtime": 52,
        "tracks": null
      },
      {
        "fileId": "287",
        "fileName": "GEN_V_2023_S01_E04_720p_AMZN_WEBRip_10bit_HEVC_x265_Hindi_AMZN_ORG.mkv",
        "seasonNumber": 1,
        "episodeNumber": 4,
        "episodeTitle": "The Whole Truth",
        "episodeOverview": "The Godolkin University Police Department is seeking any information on the person or persons who violated the Polarity statue in the groin/genital area last night outside the School of Crimefighting. If you have any information, please contact @GodUPD.",
        "runtime": 47,
        "tracks": null
      },
      {
        "fileId": "288",
        "fileName": "Gen_V_S01E05_Welcome_to_the_Monster_Club_720p_AMZN_WEB_DL_DUAL_DDP5.mkv",
        "seasonNumber": 1,
        "episodeNumber": 5,
        "episodeTitle": "Welcome to the Monster Club",
        "episodeOverview": "REWARD! Last night, The Incredible Steve attended an off-campus party where his penis was lost. He just wants it back, so his family is offering a $10,000 REWARD for its safe return, no questions asked. Please contact the Godolkin Daily Classifieds Office or the Lost-and-Found Desk at the Godolkin Student Union.",
        "runtime": 41,
        "tracks": null
      },
      {
        "fileId": "289",
        "fileName": "GEN_V_2023_S01_E06_720p_AMZN_WEBRip_10bit_HEVC_x265_Hindi_AMZN_ORG.mkv",
        "seasonNumber": 1,
        "episodeNumber": 6,
        "episodeTitle": "Jumanji",
        "episodeOverview": "The Godolkin University School of Crimefighting is excited to announce its newest course offering: THE PSYCHOLOGY OF SUPERVILLAINS! By studying the most well-known example of a supervillain, Soldier Boy, the course will investigate what makes a superhero go bad, from their flawed origin story, to the vices and moral compromises that lead them astray! Space is limited! Sign up today!",
        "runtime": 41,
        "tracks": null
      },
      {
        "fileId": "290",
        "fileName": "Gen.V.S01E07.720p.10bit.Hindi.English.Esubs.Vegamovies.To.mkv",
        "seasonNumber": 1,
        "episodeNumber": 7,
        "episodeTitle": "Sick",
        "episodeOverview": "Calling all God U #Hometeamers! Today we’re protesting Socialist Victoria Neuman’s town hall on campus! Let’s show Neuman and her Supe-hating woke mob that we won’t put up with their anti-Superhero agenda! THEY WILL NOT CONTROL US! #MakeAmericaSuperAgain #SupeLivesMatter",
        "runtime": 49,
        "tracks": null
      },
      {
        "fileId": "291",
        "fileName": "GEN_V_2023_S01E08_720p_10bit_HEVC_x265_HIN_ENG_x265_ESub_Vegamovies.mkv",
        "seasonNumber": 1,
        "episodeNumber": 8,
        "episodeTitle": "Guardians of Godolkin",
        "episodeOverview": "If you or a human loved one have been injured or killed while working at Godolkin University, you may be entitled to financial compensation. Hundreds of human employees have been victimized by Godolkin students, but the law offices of Bremmer & Bremmer have won them millions in personal injury and wrongful death lawsuits. Contact us for a free consultation at 1-888-177-2774. Know your rights!",
        "runtime": 39,
        "tracks": null
      }
    ],
    "2": [
      {
        "fileId": "779",
        "fileName": "Gen_V_S02E01_New_Year_New_U_720p_AMZN_WEB_DL_DDP5_1_x264_Vegamovies.mkv",
        "seasonNumber": 2,
        "episodeNumber": 1,
        "episodeTitle": "New Year, New U",
        "episodeOverview": "Welcome to a new year at God U! Check out all the super security upgrades around campus! Hear from our new fearless leader, Dean Cipher, during a special welcome assembly! Reunite with old friends in our brand new Victoria Neuman Student Union, and make new friends through our revitalized, robust Greek life! This year will be way better than last year, and we can't wait!",
        "runtime": 50,
        "tracks": null
      },
      {
        "fileId": "780",
        "fileName": "Gen_V_S02E02_Justice_Never_Forgets_720p_AMZN_WEB_DL_DDP5_1_x264.mkv",
        "seasonNumber": 2,
        "episodeNumber": 2,
        "episodeTitle": "Justice Never Forgets",
        "episodeOverview": "Think you're a history buff? Think again! Even a know-it-all will learn a thing or two in the God U Archives. To book a six hour educational adventure led by the world's best archivist, contact Kyle@remembererforever.com.",
        "runtime": 46,
        "tracks": null
      },
      {
        "fileId": "781",
        "fileName": "Gen_V_S02E03_H_is_for_Human_720p_AMZN_WEB_DL_DDP5_1_x264_Vegamovies.mkv",
        "seasonNumber": 2,
        "episodeNumber": 3,
        "episodeTitle": "H Is for Human",
        "episodeOverview": "*This is a campus wide reminder.* All student flyers must be approved by God U administrators before they are posted to community bulletin boards. Please submit all text and graphics to the Office of Student Life ATTN: Stacey, at least 24 hours before posting your flyer. Campus security is actively monitoring all public areas for unapproved signage and inappropriate content.",
        "runtime": 55,
        "tracks": null
      },
      {
        "fileId": "782",
        "fileName": "Gen.V.S02E04.WEB-DL.HIN.ENG.720p.x264.ESub.Vegamovies.hot.mkv",
        "seasonNumber": 2,
        "episodeNumber": 4,
        "episodeTitle": "Bags",
        "episodeOverview": "Congratulations! You secured a VIP ticket to the big fight! Attendees assume all liabilities. You may appear on camera or come in contact with bodily fluids. As a reminder, The Vought International Hotel and Spa forbids outside beverages and gender neutral bathrooms. Enjoy your VIP Experience!",
        "runtime": 49,
        "tracks": null
      },
      {
        "fileId": "783",
        "fileName": "Gen.V.S02E05.720p.WEB-DL.HIN-ENG.x264.ESub-Vegamovies.Hot.mkv",
        "seasonNumber": 2,
        "episodeNumber": 5,
        "episodeTitle": "The Kids Are Not All Right",
        "episodeOverview": "Facility Code 5827 - USE OF POWERS STRICTLY PROHIBITED. Facility Code 3567 - HANDS MUST BE VISIBLE AT ALL TIMES Facility Code 843 - ANY PERSONAL ITEM DEEMED AN ENHANCEMENT TO YOUR POWER SET WILL BE CONFISCATED. Facility Code 2536 - RESTRAINT TECHNOLOGIES ACTIVE IN ALL AREAS. Facility Code - 9832 - ALL DETAINEES SUBJECT TO BODY CAVITY SEARCH AT ANY TIME.",
        "runtime": 49,
        "tracks": null
      },
      {
        "fileId": "784",
        "fileName": "Gen.V.S02E06.720p.WEB-DL.HIN-ENG.x264.ESub-Vegamovies.Hot.mkv",
        "seasonNumber": 2,
        "episodeNumber": 6,
        "episodeTitle": "Cooking Lessons",
        "episodeOverview": "Worried about the coming culture war and apocalypse? Ride it out in style and comfort! Sustainable septic systems AND Feng Shui! Blast proof and billionaire approved! The world may be burning, but you'll be 35 feet underground with a glass of ’82 Bordeaux! Act now before it's too late",
        "runtime": 46,
        "tracks": null
      },
      {
        "fileId": "785",
        "fileName": "Gen_V_S02E07_720p_Dual_Audio_Hindi_English_WEB_DL_Vegamovies_Hot.mkv",
        "seasonNumber": 2,
        "episodeNumber": 7,
        "episodeTitle": "Hell Week",
        "episodeOverview": "A Reminder from the Office of Student Conduct: God U strictly prohibits hazing. Students should never be called demeaning names, forced to wear humiliating clothes, or treated like any animal. If you see something, say something! No one will call you a narc.",
        "runtime": 42,
        "tracks": null
      },
      {
        "fileId": "786",
        "fileName": "Gen.V.S02E08.720p.WEB-DL.HIN-ENG.x264.ESub-Vegamovies.hot.mkv",
        "seasonNumber": 2,
        "episodeNumber": 8,
        "episodeTitle": "Trojan",
        "episodeOverview": "Hello {{FirstName}} {{LastName}}. You've been selected for the 10:30 AM session.** Please be on time. Once a session begins, students may not leave for any reason. Check in with Vance outside of the Advanced Seminar Room when you arrive. Good luck! ** By accepting this invitation, you assume inherent risks involved with this activity including but not limited to physical harm, injury, or death.",
        "runtime": 47,
        "tracks": null
      }
    ]
  },
  "episodes": [],
  "availableSeasons": [
    1,
    2
  ],
  "availableEpisodeCount": 16
}