{
  "showTmdbId": 280889,
  "showTitle": "Bada Naam Karenge",
  "originalShowTitle": "Bada Naam Karenge",
  "overview": "Rishabh and Surbhi, two young individuals, find themselves at the crossroads of an arranged marriage. The story unfolds in two timelines: one in Mumbai, in the past, and another in Madhya Pradesh, where their families meet. In Mumbai, they find themselves alone in his room due to the lockdown, creating a pivotal moment in their relationship. In the present, Rishabh is hesitant to reveal his past with Surbhi to their families, his being a much more traditional one, fearing disapproval.",
  "genres": [
    "Drama",
    "Family"
  ],
  "rating": 7.5,
  "popularity": 1.3235,
  "poster": "/data/posters/show_280889.jpg",
  "backdrop": "/data/backdrops/show_280889_bd.jpg",
  "totalSeasons": 1,
  "totalEpisodes": 9,
  "year": 2025,
  "releaseDate": "2025-02-07",
  "seasons": {
    "1": [
      {
        "fileId": "510",
        "fileName": "Bada_Naam_Karenge_S01E01_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies.mkv",
        "seasonNumber": 1,
        "episodeNumber": 1,
        "episodeTitle": "Main Tujhe Phir Milungi",
        "episodeOverview": "Rishabh and Surbhi, two young individuals, find themselves at the crossroads of an arranged marriage. The story unfolds in two timelines: one in Mumbai, in the past, and another in Madhya Pradesh, where their families meet. In Mumbai, they find themselves alone in his room due to the lockdown, creating a pivotal moment in their relationship. In the present, Rishabh is hesitant to reveal his past with Surbhi to their families, his being a much more traditional one, fearing disapproval.",
        "runtime": 57,
        "tracks": null
      },
      {
        "fileId": "511",
        "fileName": "Bada_Naam_Karenge_S01E02_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies.mkv",
        "seasonNumber": 1,
        "episodeNumber": 2,
        "episodeTitle": "Rishte Ka Evaluation",
        "episodeOverview": "The sudden lockdown throws everything into chaos. Rishabh attempts to arrange for Surbhi to return to her hostel, but while he's downstairs, Surbhi accidentally locks herself out while taking out the garbage. Meanwhile, as the Gupta family prepares to visit the Rathis' home for the arranged marriage, Surbhi's brother Shekhar raises concerns about Tauji's strict behaviour toward his sister Neeta.",
        "runtime": 35,
        "tracks": null
      },
      {
        "fileId": "512",
        "fileName": "Bada_Naam_Karenge_S01E03_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies.mkv",
        "seasonNumber": 1,
        "episodeNumber": 3,
        "episodeTitle": "Jhooth",
        "episodeOverview": "In Mumbai, Rishabh realizes they're locked out of the flat. Fearing that Surbhi might be noticed by his neighbour, he arranges for a keymaker. Rishabh and Surbhi spend time together, discussing their goals and family expectations, but the situation takes a turn when they realize that the keymaker has tested positive for COVID. In the present, the Gupta family visits the Rathi household. Surbhi is overcome with guilt when Vivek presents her with a silver coin, symbolizing the family’s acceptance.",
        "runtime": 32,
        "tracks": null
      },
      {
        "fileId": "513",
        "fileName": "Bada_Naam_Karenge_S01E04_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies.mkv",
        "seasonNumber": 1,
        "episodeNumber": 4,
        "episodeTitle": "Positive or Negative",
        "episodeOverview": "In Mumbai, Rishabh agrees to take a COVID test after realizing the seriousness of his symptoms. Surbhi decides to stay with him till his test report is out, offering care and support, which deepens their bond. In Ratlam, Surbhi and her family prepare to leave the Rathi residence. Rishabh seeks permission to accompany Surbhi and show her around the city and is filled with excitement, but Surbhi, still emotionally weighed down, admits that she can't go through with a marriage based on a lie.",
        "runtime": 36,
        "tracks": null
      },
      {
        "fileId": "514",
        "fileName": "Bada_Naam_Karenge_S01E05_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies.mkv",
        "seasonNumber": 1,
        "episodeNumber": 5,
        "episodeTitle": "Kaafi Hai Na",
        "episodeOverview": "A year ago, during Diwali, Tauji shared his journey of building a business with Rishabh, stressing the balance of progress and heritage. In Mumbai, Surbhi leaves for her hostel, but Rishabh finds her earring, reigniting his love. He sneaks into her room, and they share a kiss before he escapes unnoticed. Their secret romance grows until Surbhi vanishes after a call from her brother. In Ujjain, marriage proposals loom, pushing Rishabh to propose. Surbhi accepts as Rajesh uncovers secrets.",
        "runtime": 49,
        "tracks": null
      },
      {
        "fileId": "515",
        "fileName": "Bada_Naam_Karenge_S01E06_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies.mkv",
        "seasonNumber": 1,
        "episodeNumber": 6,
        "episodeTitle": "Nazar Na Lage",
        "episodeOverview": "In Ratlam, Tauji handles a legal matter while Rajesh informs him that Surbhi’s background check was approved, leading to joyful acceptance of the proposal. A flashback shows the matron warning Rajesh about his inquiries. In Ujjain, wedding preparations begin as both families celebrate. Tauji insists Rajesh stay at Rishabh’s flat in Mumbai. As the 'roka' ceremony nears, Rajesh, pressured over a loan, overhears Neeta questioning Jagatram about a girl at Rishabh’s flat, adding to the tension.",
        "runtime": 47,
        "tracks": null
      },
      {
        "fileId": "516",
        "fileName": "Bada_Naam_Karenge_S01E07_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies.mkv",
        "seasonNumber": 1,
        "episodeNumber": 7,
        "episodeTitle": "Code of Conduct",
        "episodeOverview": "At the Gupta residence, the 'roka' is in full swing, but Sapna notices Rajesh and Neeta’s absence. Rajesh, in Mumbai, visits Surbhi’s hostel while Neeta warns Rishabh to deny any accusations. After the 'roka', the Rathi family sets a wedding date. Back home, Rajesh confronts Rishabh about parties and a girl, Divya, linking her to Surbhi’s college. Rishabh stays silent, relieved Surbhi’s name is safe. Neeta exposes an unapologetic Rajesh’s motives. Tension peaks as Lalit suddenly collapses.",
        "runtime": 46,
        "tracks": null
      },
      {
        "fileId": "517",
        "fileName": "Bada_Naam_Karenge_S01E08_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies.mkv",
        "seasonNumber": 1,
        "episodeNumber": 8,
        "episodeTitle": "Sach",
        "episodeOverview": "In Mumbai, Rishabh plans to confess to Surbhi, but she rushes to Ujjain after learning of her father’s heart attack. In the present day, Surbhi, still in her wedding lehenga at the hospital, learns Lalit had a myocardial infarction. Meanwhile, a furious Shekhar breaks the alliance, and Rishabh sneaks out to see Surbhi, who later reveals to her family that she stayed at his flat. At the ghat, she and Rishabh embrace, unaware their confession video is being watched by their families.",
        "runtime": 49,
        "tracks": null
      },
      {
        "fileId": "518",
        "fileName": "Bada_Naam_Karenge_S01E09_720p_Hindi_WEB_DL_5_1_ESub_x264_Vegamovies.mkv",
        "seasonNumber": 1,
        "episodeNumber": 9,
        "episodeTitle": "Ratlam Junction",
        "episodeOverview": "Surbhi's family confronts her confession video but Lalit defends her. Tauji, humiliated by gossip, agrees to a facade marriage. On Janmashtami, Tauji announces an unapproved wedding date, leading to tension. Will Rishabh agree to marry for appearances? What is in fate for Rishabh and Surbhi?",
        "runtime": 83,
        "tracks": null
      }
    ]
  },
  "episodes": [],
  "availableSeasons": [
    1
  ],
  "availableEpisodeCount": 9
}